CREATE TABLE Предмет (
    id INT PRIMARY KEY,
    название VARCHAR(255),
    описание TEXT
);

CREATE TABLE Преподаватели (
    id INT PRIMARY KEY,
    имя VARCHAR(255),
    фамилия VARCHAR(255),
    предмет_id INT,
    FOREIGN KEY (предмет_id) REFERENCES Предмет(id)
);
В этом примере мы создаем две таблицы: "Предмет" с полями "id", "название" и "описание", и "Преподаватели" с полями "id", "имя", "фамилия" и "предмет_id". 
С помощью внешнего ключа FOREIGN KEY связываем таблицы по полю "предмет_id", ссылаясь на поле "id" из таблицы "Предмет".